test/liquid_solid_fluidized_bed_semi/force_buoyancy+drag+vm+lift/Yang/CFD/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSolution;
}

solvers
{
  p
  {
    solver          PCG;
    preconditioner  DIC;
    tolerance       1e-06;
    relTol          0.1;
  }

  pFinal
  {
    solver          PCG;
    preconditioner  DIC;
    tolerance       1e-06;
    relTol          0;
  }

  "(U|k|epsilon|R|nuTilda)"
  {
    solver          PBiCG;
    preconditioner  DILU;
    tolerance       1e-05;
    relTol          0;
  }

  "(voidFraction|Ksl|UsNext|voidFractionNext|sSmoothField|vSmoothField|fSmooth)"
  {
    solver          PCG;
    preconditioner  DIC;
    tolerance       1e-09;
    relTol          1e-06;
  }
}

PISO
{
  nCorrectors     4;
  nNonOrthogonalCorrectors 0;
  pRefCell        0;
  pRefValue       0;
}
